Repository: sarahamm/Traversal-App
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Hello
ar: مرحبًا

# welcome
source: Welcome to Traversal
ar: مرحبًا بك في ترافيرسل

# discover
source: DISCOVE NEW PLACES
ar: اكتشف أماكن جديدة

# travel
source: Travel Around The World
ar: سافر حول العالم

source: Search
ar: بحث

source: Devices
ar: الأجهزة

# pick_Travel_Activity
source: Pick your Favorite Travel Activity
ar: اختر نشاط السفر المفضل لديك

# interest_seleced
source: the interest seleced is :
ar: : الاهتمام المحدد هو

source: Next
ar: التالي

source: Greece
ar: اليونان

source: Iceland
ar: آيسلندا

source: Indonesia
ar: إندونيسيا

source: Australia
ar: أستراليا

source: Jordan
ar: الأردن

source: France
ar: فرنسا

# france_subTitle
source: City of love, lights, and timeless art
ar: مدينة الحب والأنوار والفن الخالد

# france_desciption
source: France is sophistication embodied — a place where art, fashion, history, and gastronomy flourish. Stroll down Parisian boulevards, marvel at the Eiffel Tower, and savor croissants in quaint cafés. Beyond the capital, you'll find lavender fields in Provence, vineyards in Bordeaux, castles in the Loire Valley, and snow-capped peaks in the Alps. Every region is unique, yet connected by a timeless elegance that defines France.
ar: فرنسا تجسيدٌ للرقيّ، مكانٌ يزدهر فيه الفنّ والموضة والتاريخ وفنون الطهي. تجوّل في شوارع باريس، وانبهر ببرج إيفل، وتذوّق الكرواسون في مقاهيها الجذابة. وخارج العاصمة، ستجد حقول الخزامى في بروفانس، وكروم العنب في بوردو، وقلاع وادي لوار، وقمم جبال الألب المغطاة بالثلوج. لكلّ منطقةٍ منها طابعها الفريد، ومع ذلك، تجمعها أناقةٌ خالدةٌ تُميّز فرنسا.

source: Japan
ar: اليابان

# japan_subTitle
source: A fusion of tradition and cutting-edge technology
ar: مزيج من التقاليد والتكنولوجيا المتطورة

# japan_description
source: Japan is a land of contrasts and harmony — a place where ancient temples coexist with neon-lit cities. Whether you're wandering through Kyoto’s peaceful bamboo forests, experiencing Tokyo’s tech-powered energy, or catching the cherry blossoms in full bloom, every moment feels intentional and graceful. Its culture is rich in respect and tradition, from samurai heritage to the meticulous art of sushi. Japan offers a travel experience that's as serene as it is futuristic.
ar: اليابان أرض التناقضات والتناغم، حيث تتعايش المعابد القديمة مع المدن المضاءة بالنيون. سواء كنت تتجول في غابات الخيزران الهادئة في كيوتو، أو تختبر حيوية طوكيو التي تنبض بالتكنولوجيا، أو تستمتع بأزهار الكرز في أوج تفتحها، فإن كل لحظة تشعرك بالرقي والجمال. ثقافتها غنية بالاحترام والتقاليد، من تراث الساموراي إلى فن السوشي الدقيق. تقدم اليابان تجربة سفر هادئة بقدر ما هي مستقبلية.

source: South Africa
ar: جنوب أفريقيا

# southAfrica_subTitle
source: Stunning mountains meet the ocean
ar: جبال رائعة تلتقي مع المحيط

# southAfrica_description
source: South Africa is a dream destination for adventurers and nature lovers. It boasts diverse wildlife, stunning coastlines, vibrant cities, and a deep cultural legacy. Go on a Big Five safari in Kruger National Park, hike the iconic Table Mountain, or visit the bustling neighborhoods of Cape Town and Johannesburg. South Africa is more than a place — it's a journey through landscapes and legacies that leave a lasting impression.
ar: جنوب أفريقيا وجهةٌ مثاليةٌ للمغامرين وعشاق الطبيعة. فهي تتميّز بحياة برية متنوعة، وسواحل خلابة، ومدن نابضة بالحياة، وإرث ثقافي عريق. انطلق في رحلة سفاري لمشاهدة الحيوانات الخمسة الكبرى في منتزه كروجر الوطني، أو تسلّق جبل تيبل الشهير، أو زُر أحياء كيب تاون وجوهانسبرغ النابضة بالحياة. جنوب أفريقيا أكثر من مجرد مكان، إنها رحلةٌ عبر مناظر طبيعية وإرثٍ عريق يترك انطباعًا لا يُنسى.

source: Canada
ar: كندا

# canada_subTitle
source: Breathtaking nature and vibrant cities
ar: طبيعة خلابة ومدن نابضة بالحياة

# canada_description
source: Canada is the land of majestic mountains, endless forests, and some of the friendliest people you'll ever meet. From the French charm of Quebec to the cosmopolitan vibe of Toronto and Vancouver, Canada balances city energy with untamed wilderness. Experience the breathtaking beauty of Banff and Jasper, paddle across glassy lakes, or chase the northern lights in Yukon. It’s a destination that feels peaceful, vast, and full of wonder.
ar: كندا أرض الجبال الشامخة والغابات الشاسعة، وبعض من ألطف الناس الذين ستقابلهم على الإطلاق. من سحر كيبيك الفرنسي إلى أجواء تورنتو وفانكوفر العالمية، توازن كندا بين حيوية المدينة وجمال الطبيعة البرية. استمتع بجمال بانف وجاسبر الأخّاذ، أو تجدّف عبر البحيرات الزجاجية، أو راقب الأضواء الشمالية في يوكون. إنها وجهة تشعرك بالسكينة والاتساع والروعة.

source: Brazil
ar: البرازيل

# brazil_subTitle
source: Carnivals, beaches, and rainforest adventures
ar: كرنفالات، شواطئ، ومغامرات في الغابات

# brazil_description
source: Brazil is color, rhythm, and untamed beauty. Home to the Amazon rainforest, the roaring Iguazu Falls, and the iconic Christ the Redeemer, it's a place of natural wonders and cultural richness. Dance to samba beats at Carnival, lounge on Copacabana Beach, or explore the historic towns of the interior. With its warm people and infectious spirit, Brazil pulses with life and welcomes all who visit with open arms.
ar: البرازيل هي الألوان والإيقاعات والجمال الجامح. موطن غابات الأمازون المطيرة، وشلالات إجوازو الهادرة، وتمثال المسيح الفادي الشهير، إنها أرضٌ تزخر بالعجائب الطبيعية والثراء الثقافي. ارقص على أنغام السامبا في الكرنفال، واسترخِ على شاطئ كوباكابانا، أو استكشف المدن التاريخية في الداخل. بشعبها الودود وروحها النابضة بالحياة، تنبض البرازيل بالحياة وترحب بكل من يزورها بحفاوة بالغة.

source: Italy
ar: إيطاليا

# italy_subTitle
source: Romantic canals and Renaissance charm
ar: قنوات رومانسية وسحر عصر النهضة

# italy_description
source: Italy is a country steeped in history, art, and elegance. From the ancient ruins of Rome and the romantic gondolas of Venice to the Renaissance masterpieces of Florence, it offers a timeless experience. Explore sun-drenched coastlines, charming hill towns, and a culinary scene that has inspired the world — pizza, pasta, espresso, and more. Whether you're sipping wine in Tuscany or hiking the cliffs of Cinque Terre, Italy blends beauty, culture, and passion like no other.
ar: إيطاليا بلدٌ عريقٌ في التاريخ والفن والأناقة. من أطلال روما القديمة وقوارب البندقية الرومانسية إلى روائع عصر النهضة في فلورنسا، تُقدّم تجربةً خالدةً. استكشف سواحلها المشمسة، ومدنها الجبلية الساحرة، وفنونها الطهوية التي ألهمت العالم - بيتزا، ومعكرونة، وإسبريسو، وغيرها الكثير. سواءً كنت ترتشف النبيذ في توسكانا أو تتنزه على منحدرات سينك تير، فإن إيطاليا تمزج الجمال والثقافة والشغف بشكلٍ لا مثيل له.

source: Thailand
ar: تايلاند

# thailand_subTitle
source: Tropical beaches and vibrant street life
ar: شواطئ استوائية وحياة شارع نابضة

# thailand_description
source: Thailand is a vibrant tapestry of spiritual tradition, exotic beauty, and warm hospitality. Wander through golden temples, bustling night markets, and lush jungles. Bask on tropical islands like Phuket and Koh Samui, or explore the rich culture and street food of Bangkok and Chiang Mai. Whether you’re seeking serenity or excitement, Thailand offers a journey that touches the soul and satisfies the senses.
ar: تايلاند نسيجٌ نابضٌ بالحياة من التقاليد الروحية، والجمال الأخّاذ، وكرم الضيافة. تجوّل بين المعابد الذهبية، والأسواق الليلية الصاخبة، والغابات الوارفة. استمتع بدفء الجزر الاستوائية مثل بوكيت وكوه ساموي، أو استكشف الثقافة الغنية ومأكولات الشوارع في بانكوك وشيانغ ماي. سواء كنت تبحث عن الهدوء أو الإثارة، تُقدّم تايلاند رحلةً تُلامس الروح وتُرضي الحواس.

source: Favourite_Places
ar: الأماكن المفضلة

source: Want To Visit
ar: أرغب في زيارتها

source: Visited
ar: زُرت

source: Planned
ar: مخطط لها

source: Adventure
ar: مغامرة

source: Discover New Culture
ar: اكتشف ثقافات جديدة

source: Vacation
ar: إجازة

source: Job Trip
ar: رحلة عمل

# fieldNotFilled
source: ❌You haven't filled the required field
ar: ❌لم تقم بملء الحقول المطلوبة

# fieldFilled
source: has added ✅
ar: أضافت✅

# aboutplaceTap
source: About The Place
ar: حول المكان

# gallaryplaceTap
source: Gallary
ar: معرض الصور

# pickLandplaceTap
source: Pick a land
ar: اختر رحلة
